app/controllers/products_controller.rb

  def index
    if params[:product].present?
      @products = Product.find_by(name: params[:product]) || Product.order_by_date
---
SELECT "products".* FROM "products" ORDER BY "products"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."name" = ? LIMIT ?  [["name", "Falda"], ["LIMIT", 1]]

  def create
    @product = Product.new(product_params)
    @product.save
---
INSERT INTO "products" ("name", "price", "stock", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Jean Shorts"], ["price", 11.8], ["stock", 13], ["created_at", "2025-04-14 15:47:34.056618"], ["updated_at", "2025-04-14 15:47:34.056618"]]

  def update
    @product.update(product_params)
---
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 20.0], ["updated_at", "2025-04-14 15:48:06.345302"], ["id", 1]]